
tap "github/gh"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/autoupdate"

brew "checkov" # IaC policy check https://checkov.io
brew "cloud-nuke" # Destroyer of clouds.
brew "gh" # Github Cli
brew "git" # Git SCM client
brew "graphviz" # Graph visualizer
brew "make" # Makefile processor
brew "pre-commit" # Pre-commit static analysis
brew "terraform-docs" # Automatic documentation for Terraform modules
brew "terragrunt" # Terraform preprocessor to keep configs DRY.
brew "tfenv" # Terraform version manager
brew "tflint" # Terraform linter
brew "kreuzwerker/taps/m1-terraform-provider-helper" # For m1 Mac compat.

cask "atlantis" # Terraform CD
cask "github" # Github Desktop
cask "iterm2" # Terminal Emulator
cask "ngrok" # Request forwarder
cask "visual-studio-code" # Code Editor

